In [8]:
'''Here we will study about Missing data or null data'''
import numpy as np
import pandas as pd

In [10]:
dicnry = {'A':[1,2,3], 'B':[3,np.nan,2], 'C':[3,np.nan,np.nan,]}
df = pd.DataFrame(dicnry)
df

   A    B    C
0  1  3.0  3.0
1  2  NaN  NaN
2  3  2.0  NaN

In [11]:
# to check null values
df.isnull()

       A      B      C
0  False  False  False
1  False   True   True
2  False  False   True

In [12]:
# for drop null values
df.dropna() # it will drop all the null values along with its row

   A    B    C
0  1  3.0  3.0

In [13]:
df.dropna(axis=1) # via axis = 1 it will drop values according to columns

   A
0  1
1  2
2  3

In [14]:
'''here we can set threashold on the basis of how many non null value in a dataframe'''
df.dropna(thresh=1)

   A    B    C
0  1  3.0  3.0
1  2  NaN  NaN
2  3  2.0  NaN

In [15]:
'''for fill missing values we can use fillna()'''
df.fillna(value='nik')

   A    B    C
0  1  3.0  3.0
1  2  nik  nik
2  3  2.0  nik

In [20]:
'''here we can fill the value to mean of the 'B', 
inplace command is use for values change in real time to DataFrame'''
df['B'].fillna(value=df['B'].mean(),inplace=True)

In [23]:
df['C'].fillna(value=df['C'].mean())

0    3.0
1    3.0
2    3.0
Name: C, dtype: float64

In [24]:
df

   A    B    C
0  1  3.0  3.0
1  2  2.5  NaN
2  3  2.0  NaN